src/cf/InformationRegisters/ОбщиеНастройкиРаспознаваниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбщиеНастройкиРаспознаваниеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказыватьЭлементыНастройкиИнтерфейса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьЗамечанияПередСозданиемДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадаватьВопросОСохраненииСоответствийДляРаспознанныхСтрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантСохраненияСоответствий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСохраненияСоответствийБРД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьНовыеЭлементыСправочниковПослеСоздания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаОбработчикаПоказыватьИзображенияВШапке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастотаОтправкиВложенийИзПочтыНаРаспознавание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспознаватьВложенияИзПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочтаДляОбработкиВложений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейОбработкиВложений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспознаватьФайлыИзКаталога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастотаОтправкиФайловИзКаталогаНаРаспознавание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогДляОбработкиФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключаяВложенныеКаталоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СкладБРД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриОбнаруженииДокументаПрикреплятьИзображениеАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПомечатьДокументОбработаннымПриПрикреаленииИзображения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСчетФактуруПриСозданииОснования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоматическиУдалятьОбработанныеИПомеченныеНаУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОтсрочкиУдаленияУстаревшихДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодыОтсрочкиУдаленияУстаревшихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПорогНоменклатурыДляГрупповогоСоздания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЧастотаЗагрузкиДокументовИзСервиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВариантыСохраненияСоответствийБРД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыСохраненияСоответствийБРД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СохранятьАвтоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадаватьВопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСохранятьИНеЗадаватьВопрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ПериодыОтсрочкиУдаленияУстаревшихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПериодыОтсрочкиУдаленияУстаревшихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Через1День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Через1Неделю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Через1Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Через3Месяца</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ОбщиеНастройкиРаспознаваниеДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекущиеНастройки() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПоказыватьЭлементыНастройкиИнтерфейса", Истина);
	Результат.Вставить("ПроверятьЗамечанияПередСозданиемДокументов", Истина);
	Результат.Вставить("ЗадаватьВопросОСохраненииСоответствийДляРаспознанныхСтрок", Ложь);
	Результат.Вставить("ВариантСохраненияСоответствий", Перечисления.ВариантыСохраненияСоответствийБРД.СохранятьАвтоматически);
	Результат.Вставить("ОткрыватьНовыеЭлементыСправочниковПослеСоздания", Ложь);
	
	Результат.Вставить("ФормаОбработчикаПоказыватьИзображенияВШапке", Ложь);
	
	Результат.Вставить("РаспознаватьВложенияИзПочты", Ложь);
	Результат.Вставить("ЧастотаОтправкиВложенийИзПочтыНаРаспознавание", 30);
	Результат.Вставить("ЭлектроннаяПочтаДляОбработкиВложений", Неопределено);
	Результат.Вставить("ДатаПоследнейОбработкиВложений", '00010101');
	
	Результат.Вставить("РаспознаватьФайлыИзКаталога", Ложь);
	Результат.Вставить("ЧастотаОтправкиФайловИзКаталогаНаРаспознавание", 30);
	Результат.Вставить("КаталогДляОбработкиФайлов", 0);
	Результат.Вставить("ВключаяВложенныеКаталоги", 0);
	
	Результат.Вставить("СкладПоУмолчанию");
	Результат.Вставить("ПриОбнаруженииДокументаПрикреплятьИзображениеАвтоматически", Ложь);
	Результат.Вставить("ПомечатьДокументОбработаннымПриПрикрепленииИзображения", Истина);
	Результат.Вставить("СоздаватьСчетФактуруПриСозданииОснования", Ложь);
	Результат.Вставить("АдресЭлПочты", "");
	
	Результат.Вставить("АвтоматическиУдалятьОбработанныеИПомеченныеНаУдаление", Истина);
	Результат.Вставить("ПериодОтсрочкиУдаленияУстаревшихДокументов", Перечисления.ПериодыОтсрочкиУдаленияУстаревшихДокументов.Через1Неделю);
	
	// Извлечение сохраненных настроек
	
	ИзвлеченныеНастройки = ОбщегоНазначения.СкопироватьРекурсивно(Результат);
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(ИзвлеченныеНастройки, МенеджерЗаписи);
	КонецЕсли;
	
	// Применение настроек, отличающихся от значений по-умолчанию
	// Если настройка была добавлена, то при обновлении БД ресурс будет иметь незаполненное значение
	// Потому после чтения следует незаполненные настройки привести к значениям по-умолчанию
	// Или же перенести к настройкам по-умолчанию заполненные прочитанные настройки.
	
	Для Каждого Настройка Из ИзвлеченныеНастройки Цикл
		
		Если ЗначениеЗаполнено(Настройка.Значение) Тогда
			Результат[Настройка.Ключ] = Настройка.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	// Обнуление настроек, сохраненных в базе, для временного отключения подсистемы.
	
	Результат.Вставить("РаспознаватьВложенияИзПочты", Ложь);
	Результат.Вставить("ЧастотаОтправкиВложенийИзПочтыНаРаспознавание", 30);
	Результат.Вставить("ЭлектроннаяПочтаДляОбработкиВложений", Неопределено);
	Результат.Вставить("ДатаПоследнейОбработкиВложений", '00010101');
	
	Результат.Вставить("РаспознаватьФайлыИзКаталога", Ложь);
	Результат.Вставить("ЧастотаОтправкиФайловИзКаталогаНаРаспознавание", 30);
	Результат.Вставить("КаталогДляОбработкиФайлов", 0);
	Результат.Вставить("ВключаяВложенныеКаталоги", 0);
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(Результат);
	
КонецФункции

Процедура УстановитьАвтоматическиУдалятьОбработанныеИПомеченныеНаУдаление(Значение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.АвтоматическиУдалятьОбработанныеИПомеченныеНаУдаление = Значение;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
